<details><summary>Digger run report at 2024-01-08 12:26:04 (UTC)</summary>
  <details><summary>Apply for <b>mileslee-nsuslab/quickstart-actions-aws#production</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_instance.vm_instance must be replaced
-/+ resource "aws_instance" "vm_instance" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:651482608654:instance/i-0fcb509d51c135623" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0fcb509d51c135623" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-03392b223bf362307" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-143.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.143" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "44.214.137.99" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0cdd8ebc3d258cc45",
        ]
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "terraform-instance"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0cdd8ebc3d258cc45",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-0058e715b23204e24" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp3" -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
aws_instance.vm_instance: Destroying... [id=i-0fcb509d51c135623]
aws_instance.vm_instance: Still destroying... [id=i-0fcb509d51c135623, 10s elapsed]
aws_instance.vm_instance: Still destroying... [id=i-0fcb509d51c135623, 20s elapsed]
aws_instance.vm_instance: Still destroying... [id=i-0fcb509d51c135623, 30s elapsed]
aws_instance.vm_instance: Still destroying... [id=i-0fcb509d51c135623, 40s elapsed]
aws_instance.vm_instance: Destruction complete after 40s
aws_instance.vm_instance: Creating...
aws_instance.vm_instance: Still creating... [10s elapsed]
aws_instance.vm_instance: Still creating... [20s elapsed]
aws_instance.vm_instance: Still creating... [30s elapsed]
aws_instance.vm_instance: Creation complete after 33s [id=i-0179d785c8464c011]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.

  ```
</details>
</details>